Tekla Open API Reference for Tekla Structures 2025
RebarCrankingNullable.EndCrankingTypeEnum Enumeration
 The end cranking type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum EndCrankingTypeEnum
Public Enumeration EndCrankingTypeEnum
Members
Member name | Value | Description
NO_CRANKING | 0 |  No cranking.
CUSTOM_CRANKING | 1 |  Custom cranking.
STANDARD_CRANKING | 2 |  Standard cranking.
See Also
Reference
Tekla.Structures.Model Namespace